project/atropos-go/etcd_concurrent_read-master/master/k150k_cancel/output/with_API/cheap_read.log
bench with linearizable range
 0 / 1000 B                                                                                                                                        !   0.00%INFO: 2023/06/12 14:36:53 ccResolverWrapper: sending new addresses to cc: [{localhost:2379 0  <nil>}]
INFO: 2023/06/12 14:36:53 balancerWrapper: got update addr from Notify: [{localhost:2379 <nil>}]
INFO: 2023/06/12 14:36:53 balancerWrapper: got update addr from Notify: [{localhost:2379 <nil>}]
 1000 / 1000 Booooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo! 100.00% 10s

Summary:
  Total:	10.2746 secs.
  Slowest:	0.0735 secs.
  Fastest:	0.0002 secs.
  Average:	0.0009 secs.
  Stddev:	0.0042 secs.
  Requests/sec:	97.3276

Response time histogram:
  0.0002 [1]	|
  0.0075 [989]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.0148 [1]	|
  0.0222 [1]	|
  0.0295 [2]	|
  0.0368 [0]	|
  0.0441 [4]	|
  0.0515 [0]	|
  0.0588 [0]	|
  0.0661 [1]	|
  0.0735 [1]	|

Latency distribution:
  10% in 0.0003 secs.
  25% in 0.0003 secs.
  50% in 0.0004 secs.
  75% in 0.0005 secs.
  90% in 0.0008 secs.
  95% in 0.0016 secs.
  99% in 0.0101 secs.
  99.9% in 0.0735 secs.