project/atropos-go/etcd_concurrent_read-master/master/k150k_cancel/output/with_API/cheap_write.log
 0 / 180 B                                                                                                                                         !   0.00%INFO: 2023/06/12 14:36:53 ccResolverWrapper: sending new addresses to cc: [{localhost:2379 0  <nil>}]
INFO: 2023/06/12 14:36:53 balancerWrapper: got update addr from Notify: [{localhost:2379 <nil>}]
INFO: 2023/06/12 14:36:53 balancerWrapper: got update addr from Notify: [{localhost:2379 <nil>}]
 180 / 180 Boooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo! 100.00% 8s

Summary:
  Total:	8.9694 secs.
  Slowest:	0.0646 secs.
  Fastest:	0.0002 secs.
  Average:	0.0026 secs.
  Stddev:	0.0092 secs.
  Requests/sec:	20.0682

Response time histogram:
  0.0002 [1]	|
  0.0067 [170]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.0131 [0]	|
  0.0195 [0]	|
  0.0260 [0]	|
  0.0324 [3]	|
  0.0389 [2]	|
  0.0453 [2]	|
  0.0517 [0]	|
  0.0582 [1]	|
  0.0646 [1]	|

Latency distribution:
  10% in 0.0003 secs.
  25% in 0.0004 secs.
  50% in 0.0005 secs.
  75% in 0.0007 secs.
  90% in 0.0008 secs.
  95% in 0.0293 secs.
  99% in 0.0646 secs.